### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [ ]:
# Julie Baker
# Heroes of Pymoli
# June 2021

In [58]:
# Dependencies and Setup --> need to make sure it's on my 3.8.5 to get to work right now
import pandas as pd
import os
import csv

# File to Load (Remember to Change These)
file_to_load = os.path.join(os.getcwd(), "Resources", "purchase_data.csv")

# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(file_to_load)

In [59]:
# just looking at data
purchase_df.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [60]:
# SN unique
user_count = len(purchase_df['SN'].unique())
print(user_count)

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [61]:
## WORK ON FORMATTING IF TIME LATER ##
# ===================================
# unique items
item_count = len(purchase_df["Item ID"].unique())
# average purchase price
avg_purchase = purchase_df.Price.mean()
#.. avg_purchase['Average Price'] = avg_purchase['Average Price'].map("${:,.2}".format)
# total number of purchases
total_purchases = len(purchase_df['Purchase ID'])
# total revenue
total_rev = purchase_df.Price.sum()

purchase_analysis_df = pd.DataFrame(data = [[user_count, item_count, avg_purchase, total_purchases, total_rev]], columns=["Unique Users", "Unique Items", "Average Price", "Total Purchases", "Total Revenue"])

### pd.options.display.float_format = '${:, .2f}'.format

purchase_analysis_df

   Unique Users  Unique Items  Average Price  Total Purchases  Total Revenue
0           576           179       3.050987              780        2379.77

In [62]:
# Renaming columns to remove spaces 
update_purchase_df = purchase_df.rename(columns={'Purchase ID':'PurchaseID', 'Item ID' : 'ItemID', 'Item Name' : 'ItemName'})

update_purchase_df

,PurchaseID,SN,Age,Gender,ItemID,ItemName,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [63]:
# gender demographics; based on code example from stackoverflow.com
gender_fixed = update_purchase_df.groupby(['SN','Gender'])['Gender'].count()

## THERE IS A PROBLEM WITH THIS -- it's based on all lines of data (thus summing to 780), but should just be subset based on user id (which is 576) to remove duplicates--discrepancy can be seen between these values and those generated from the newly created dataframes below
gender_fixed

SN             Gender
Adairialis76   Male      1
Adastirin33    Female    1
Aeda94         Male      1
Aela59         Male      1
Aelaria33      Male      1
                        ..
Yathecal82     Female    3
Yathedeu43     Male      2
Yoishirrala98  Female    1
Zhisrisu83     Male      2
Zontibe81      Male      3
Name: Gender, Length: 576, dtype: int64

In [64]:
# Creating dataframes for each gender group because using the original dataframe doesn't take duplicate users into account

# Female users
female_users_df = update_purchase_df.loc[update_purchase_df["Gender"] == "Female", :]
# Male users
male_users_df = update_purchase_df.loc[update_purchase_df["Gender"] == "Male", :]
# Other users
other_users_df = update_purchase_df.loc[update_purchase_df["Gender"] == "Other / Non-Disclosed", :]

In [65]:
# female count
female_count = len(female_users_df.SN.unique())
# female percentage
female_percent = (female_count / user_count)*100

In [66]:
# male count & percentage
male_count = len(male_users_df.SN.unique())
male_percent = male_count / user_count*100

In [67]:
# other count & percentage
other_count = len(other_users_df.SN.unique())
other_percent = (other_count / user_count)*100

In [68]:
# Gender Demographics Output

gender_demo_df = pd.DataFrame({
    "Gender": ["Female", "Male", "Other / Not Disclosed", "Total Players"],
    "Player Count": [female_count, male_count, other_count, user_count],
    "Percent of Players": [female_percent, male_percent, other_percent, 100]
})

# gender_demo_df["Percent of Players"] = gender_demo_df["Percent of Players"].map('{:.2%f}')
# pd.options.display.float_format = '{:.2%}'.format FIGURE THIS OUT LATER, WAS MESSING UP STUFF LATER

#purchase_analysis_df = pd.DataFrame(data = [[user_count, item_count, avg_purchase, total_purchases, total_rev]], columns=["Unique Users", "Unique Items", "Average Price", "Total Purchases", "Total Revenue"])
gender_demo_df

                  Gender  Player Count  Percent of Players
0                 Female            81           14.062500
1                   Male           484           84.027778
2  Other / Not Disclosed            11            1.909722
3          Total Players           576          100.000000


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [69]:
# purchase count by gender
female_purchases = female_users_df["PurchaseID"].count()
male_purchases = male_users_df["PurchaseID"].count()
other_purchases = other_users_df["PurchaseID"].count()

In [70]:
# average purchase price by gender
avg_price_female = female_users_df.Price.mean()
avg_price_male = male_users_df.Price.mean()
avg_price_other = other_users_df.Price.mean()

In [71]:
# total purchase value by gender
total_rev = purchase_df.Price.sum()
total_purchase_female = female_users_df.Price.sum()
total_purchase_male = male_users_df.Price.sum()
total_purchase_other = other_users_df.Price.sum()

In [72]:
# average purchase total per PERSON per GENDER
avg_purchase = purchase_df.Price.mean()
avg_total_females = total_purchase_female/female_count
avg_total_males = total_purchase_male/male_count
avg_total_other = total_purchase_other/other_count

In [73]:
## PURCHASING ANALYSIS (Gender)

gender_purchasing_df = pd.DataFrame({
    "Gender": ["Female", "Male", "Other / Not Disclosed"],
    "Player Count": [female_count, male_count, other_count],
    "Percent of Players": [female_percent, male_percent, other_percent],
    "Purchase Count": [female_purchases, male_purchases, other_purchases],
    "Average Purchase Price": [avg_price_female, avg_price_male, avg_price_other],
    "Total Purchase Value": [total_purchase_female, total_purchase_male, total_purchase_other],
    "Average Purchase Total per Person by Gender": [avg_total_females, avg_total_males, avg_total_other]
})
gender_purchasing_df

,Gender,Player Count,Percent of Players,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Gender
0,Female,81,14.062500,113,3.203009,361.94,4.468395
1,Male,484,84.027778,652,3.017853,1967.64,4.065372
2,Other / Not Disclosed,11,1.909722,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [259]:
# esatblish bins for ages
bins = [0, 9, 14, 19, 24, 29, 34, 39, 44, 49]
age_labels = ["under 10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40-44", "45-49"]

In [260]:
# use pd.cut() to categorize players using age bins
age_df = update_purchase_df
age_df["Age Group"] = pd.cut(age_df["Age"], bins, labels=age_labels)
age_df

,PurchaseID,SN,Age,Gender,ItemID,ItemName,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40-44
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,under 10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [264]:
# age demographics round 2
age_counts_df2 = age_df.groupby(['Age Group'])['SN'].nunique()
age_counts_df2

Age Group
under 10     17
10-14        22
15-19       107
20-24       258
25-29        77
30-34        52
35-39        31
40-44        11
45-49         1
Name: SN, dtype: int64

In [ ]:
#age_counts_df2['Percentage of Players'] = (age_counts_df2['Total Purchase Value'] / top5_hold_df2['Purchase Count'])

In [77]:
# Creating dataframes for each age group

group01_df = age_df.loc[update_purchase_df["Age Group"] == "10 and under", :]
group02_df = age_df.loc[update_purchase_df["Age Group"] == "11-14", :]
group03_df = age_df.loc[update_purchase_df["Age Group"] == "15-18", :]
group04_df = age_df.loc[update_purchase_df["Age Group"] == "19-22", :]
group05_df = age_df.loc[update_purchase_df["Age Group"] == "23-26", :]
group06_df = age_df.loc[update_purchase_df["Age Group"] == "27-30", :]
group07_df = age_df.loc[update_purchase_df["Age Group"] == "31-34", :]
group08_df = age_df.loc[update_purchase_df["Age Group"] == "35-38", :]
group09_df = age_df.loc[update_purchase_df["Age Group"] == "39-42", :]
group10_df = age_df.loc[update_purchase_df["Age Group"] == "43-46", :]

In [78]:
# age group counts
grp01_users = len(group01_df['SN'].unique())
grp02_users = len(group02_df['SN'].unique())
grp03_users = len(group03_df['SN'].unique())
grp04_users = len(group04_df['SN'].unique())
grp05_users = len(group05_df['SN'].unique())
grp06_users = len(group06_df['SN'].unique())
grp07_users = len(group07_df['SN'].unique())
grp08_users = len(group08_df['SN'].unique())
grp09_users = len(group09_df['SN'].unique())
grp10_users = len(group10_df['SN'].unique())

age_counts = [grp01_users, grp02_users, grp03_users, grp04_users, grp05_users, grp06_users, grp07_users, grp08_users, grp09_users, grp10_users]

In [79]:
# age group percents
grp01_percent = grp01_users / user_count *100
grp02_percent = grp02_users / user_count *100
grp03_percent = grp03_users / user_count *100
grp04_percent = grp04_users / user_count *100
grp05_percent = grp05_users / user_count *100
grp06_percent = grp06_users / user_count *100
grp07_percent = grp07_users / user_count *100
grp08_percent = grp08_users / user_count *100
grp09_percent = grp09_users / user_count *100
grp10_percent = grp10_users / user_count *100

age_percents = [grp01_percent, grp02_percent, grp03_percent, grp04_percent, grp05_percent, grp06_percent, grp07_percent, grp08_percent, grp09_percent, grp10_percent]

In [80]:
# create a summary df to hold the results; opt: round percentage to two decimals
age_demo_df = pd.DataFrame({
    "Age": age_labels,
    "Player Count": age_counts,
    "Percent of Players": age_percents
})

In [81]:
# display Age Demographics Table
age_demo_df

            Age  Player Count  Percent of Players
0  10 and under            24            4.166667
1         11-14            15            2.604167
2         15-18            90           15.625000
3         19-22           178           30.902778
4         23-26           151           26.215278
5         27-30            48            8.333333
6         31-34            27            4.687500
7         35-38            25            4.340278
8         39-42            14            2.430556
9         43-46             4            0.694444

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [82]:
# calculate the numbers & percentages by age group: purchase count, avg purchase price, total purchase value, avg purchase total per person by age
###  NEED TO FIGURE OUT HOW TO SAVE THIS IN A WAY THAT OUTPUT CAN BE CALLED -OUTSIDE- THE FUNCTION SO CAN CONCATENATE ALL RESULTS

def analyze_purchases(your_frame):
    your_group = your_frame["SN"]
    purchase_count = len(your_frame['PurchaseID'])
    avg_price = your_frame.Price.mean()
    total_value = your_frame.Price.sum()
    users_in_grp = your_frame['SN'].nunique()
    avg_total_grp = total_value / users_in_grp
    your_output_df = pd.DataFrame({
        "Age Group": [your_group],
        "Users in Group": [users_in_grp],
        "Purchase Count": [purchase_count],
        "Average Purchase Price": [avg_price],
        "Total Purchase Value": [total_value],
        "Average Purchase Total per Person by Age": [avg_total_grp] 
        })
    #print(purchase_count, avg_price, total_value, users_in_grp, avg_total_grp)
    return your_output_df
    # export as CSV to read in later? TRY AGAIN ON THIS LATER
    # your_output_df.to_csv(os.path.join(os.getcwd(),"HeroesOfPymoli", "Output","fileOut.csv"))

In [83]:
### Why does my output_df not look like a df?
### Why am I getting multiple lines on this? 
grp_10_results_df = analyze_purchases(group10_df)
grp_10_results_df

,Age Group,Users in Group,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Age
0,248 Isursuir31 674 Aeral68 728 ...,4,4,2.765,11.06,2.765

In [84]:
# Compile all summary data
print(grp_10_results_df)

                                           Age Group  Users in Group  \
0  248      Isursuir31
674         Aeral68
728   ...               4

   Purchase Count  Average Purchase Price  Total Purchase Value  \
0               4                   2.765                 11.06

   Average Purchase Total per Person by Age
0                                     2.765

In [85]:
# display Purchasing Analysis (Age)

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [195]:
# Find Top 5 Spenders by total purchase value

# creating df for finding Top 5 Spenders
top_spenders_df = update_purchase_df[['SN','Price']]
top_spenders_df = top_spenders_df.groupby('SN')

{'Adairialis76': [467], 'Adastirin33': [142], 'Aeda94': [388], 'Aela59': [28], 'Aelaria33': [630], 'Aelastirin39': [218, 766], 'Aelidru27': [705], 'Aelin32': [52, 87, 584], 'Aelly27': [43, 428], 'Aellynun67': [286], 'Aellyria80': [746], 'Aelollo59': [203, 431], 'Aenarap34': [183], 'Aeral43': [263], 'Aeral68': [674], 'Aeral97': [167], 'Aeralria27': [32], 'Aeralstical35': [583], 'Aeri84': [303], 'Aerillorin70': [381], 'Aerithllora36': [274, 578], 'Aerithnucal56': [324], 'Aerithnuphos61': [517], 'Aerithriaphos45': [40], 'Aerithriaphos46': [236], 'Aesri53': [541], 'Aesty53': [124, 253], 'Aestysu37': [309, 416], 'Aesur96': [468], 'Aesurstilis64': [405], 'Aethedru70': [775], 'Aidai53': [219], 'Aidai61': [282], 'Aidai73': [720], 'Aidaillodeu39': [42, 146], 'Aidain51': [516], 'Aidaira26': [730], 'Aiduecal76': [97, 670], 'Aiduesu86': [429], 'Aillyriadru65': [523], 'Aillyrin83': [155], 'Aina42': [83, 363, 373], 'Aina43': [94], 'Airi27': [637], 'Aisur51': [184], 'Aisurdru79': [440, 618], 'Aisurria69': [423], 'Aithelis62': [703, 760], 'Alaephos75': [295], 'Alaesu77': [494], 'Alaesu91': [285], 'Alarap40': [391], 'Ali84': [360, 635], 'Alim85': [226], 'Alo38': [63], 'Anallorgue57': [272, 311], 'Ardcil81': [398, 544], 'Ardonmol96': [566], 'Arin32': [627, 734], 'Arirgue63': [470], 'Assassa81': [631], 'Assassasta79': [270, 768], 'Assastnya25': [565], 'Assehoan67': [258], 'Assesi91': [420], 'Assilsan72': [666], 'Assim27': [761], 'Assirra56': [587], 'Assistasda42': [73, 351], 'Assistasda90': [460], 'Assjaskan56': [79], 'Assjaskan73': [13], 'Assosia88': [41], 'Assylla81': [729], 'Asty82': [680], 'Asur53': [390, 762, 772], 'Asur96': [48], 'Baelollodeu94': [178, 569], 'Bartassaya73': [387, 644], 'Caesrinusuir82': [171, 671], 'Ceoral34': [329], 'Chadadarla74': [310, 614], 'Chadilsasta32': [331, 343], 'Chadirra90': [359], 'Chadista79': [186, 506], 'Chadistaya75': [92], 'Chadjask77': [686], 'Chadjask85': [647], 'Chadolyla44': [91, 198, 711], 'Chadossa56': [570], 'Chadossa89': [98], 'Chamadar79': [262], 'Chamadarnya73': [458], 'Chamadarsda63': [642], 'Chamalo71': [19], 'Chamassasya86': [3], 'Chamast86': [653], 'Chamastya76': [307], 'Chamilsala65': [347, 504], 'Chamiman85': [733], ...}

In [202]:
# ** Total Spent **
# This new df contains the sum of the prices for each player
spend_compare_df = top_spenders_df.sum()

# This df saves the top 5 SPENDERS by sorting price as descending.
top5_spend_df = spend_compare_df.sort_values(['Price'],ascending=False).head(5)
top5_spend_df

             Price
SN
Lisosia93    18.96
Idastidru52  15.45
Chamjask73   13.83
Iral74       13.62
Iskadarya95  13.10

In [203]:
## ** Number of Purchases **
# This df contains the number of transactions for each player
purchase_counts_df = top_spenders_df.count()
purchase_counts_df

               Price
SN
Adairialis76       1
Adastirin33        1
Aeda94             1
Aela59             1
Aelaria33          1
...              ...
Yathecal82         3
Yathedeu43         2
Yoishirrala98      1
Zhisrisu83         2
Zontibe81          3

[576 rows x 1 columns]

In [204]:
# Join top 5 spenders to their purchase counts via inner join
top5_hold_df = pd.merge(top5_spend_df, purchase_counts_df, on='SN')
top5_hold_df

             Price_x  Price_y
SN
Lisosia93      18.96        5
Idastidru52    15.45        4
Chamjask73     13.83        3
Iral74         13.62        4
Iskadarya95    13.10        3

In [205]:
# Renaming columns
top5_hold_df2 = top5_hold_df.rename(columns={'Price_x': 'Total Purchase Value', 'Price_y': 'Purchase Count'})
top5_hold_df2

             Total Purchase Value  Purchase Count
SN
Lisosia93                   18.96               5
Idastidru52                 15.45               4
Chamjask73                  13.83               3
Iral74                      13.62               4
Iskadarya95                 13.10               3

In [250]:
# create a new column with calculated avg price per transaction
top5_hold_df2['Average Purchase Price'] = (top5_hold_df2['Total Purchase Value'] / top5_hold_df2['Purchase Count'])
top5_hold_df2

             Total Purchase Value  Purchase Count  Average Purchase Price
SN
Lisosia93                   18.96               5                3.792000
Idastidru52                 15.45               4                3.862500
Chamjask73                  13.83               3                4.610000
Iral74                      13.62               4                3.405000
Iskadarya95                 13.10               3                4.366667

In [208]:
## TOP SPENDERS ##
# Table should have: SN, purchase count, average purchase price, total purchase value
top5_final_df = top5_hold_df2[['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']].head(5)
top5_final_df

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [212]:
# create df for items
item_df = update_purchase_df[['ItemID', 'ItemName', 'Price']]
item_df = item_df.groupby(['ItemID', 'ItemName'])

item_df.head()

     ItemID                                   ItemName  Price
0       108  Extraction, Quickblade Of Trembling Hands   3.53
1       143                          Frenzied Scimitar   1.56
2        92                               Final Critic   4.88
3       100                                Blindscythe   3.27
4       131                                       Fury   1.44
..      ...                                        ...    ...
764     113                          Solitude's Reaver   4.07
765     130                                      Alpha   2.07
766      58          Freak's Bite, Favor of Holy Might   4.14
777      67      Celeste, Incarnation of the Corrupted   3.46
779      50                                       Dawn   4.60

[690 rows x 3 columns]

In [222]:
# purchase count sorted descending
item_counts_df = item_df.count()
item_counts_df = item_counts_df.sort_values(['Price'],ascending=False)
item_counts_df

                                                     Price
ItemID ItemName
92     Final Critic                                     13
178    Oathbreaker, Last Hope of the Breaking Storm     12
145    Fiery Glass Crusader                              9
132    Persuasion                                        9
108    Extraction, Quickblade Of Trembling Hands         9
...                                                    ...
42     The Decapitator                                   1
51     Endbringer                                        1
118    Ghost Reaver, Longsword of Magic                  1
104    Gladiator's Glaive                                1
91     Celeste                                           1

[179 rows x 1 columns]

In [219]:
# average item price
item_avg_df = item_df.mean()
item_avg_df

                                                      Price
ItemID ItemName
0      Splinter                                      1.2800
1      Crucifer                                      2.9425
2      Verdict                                       2.4800
3      Phantomlight                                  2.4900
4      Bloodlord's Fetish                            1.7000
...                                                     ...
178    Oathbreaker, Last Hope of the Breaking Storm  4.2300
179    Wolf, Promise of the Moonwalker               4.4800
181    Reaper's Toll                                 1.6600
182    Toothpick                                     4.0300
183    Dragon's Greatsword                           1.0900

[179 rows x 1 columns]

In [215]:
# total purchase value
item_values_df = item_df.sum()
item_values_df

                                                     Price
ItemID ItemName
0      Splinter                                       5.12
1      Crucifer                                      11.77
2      Verdict                                       14.88
3      Phantomlight                                  14.94
4      Bloodlord's Fetish                             8.50
...                                                    ...
178    Oathbreaker, Last Hope of the Breaking Storm  50.76
179    Wolf, Promise of the Moonwalker               26.88
181    Reaper's Toll                                  8.30
182    Toothpick                                     12.09
183    Dragon's Greatsword                            3.27

[179 rows x 1 columns]

In [236]:
# merge counts to avg
item_hold_df = pd.merge(item_counts_df, item_avg_df, on=['ItemID', 'ItemName'],how='outer')
item_hold_df.head()

                                                     Price_x   Price_y
ItemID ItemName
92     Final Critic                                       13  4.614615
178    Oathbreaker, Last Hope of the Breaking Storm       12  4.230000
145    Fiery Glass Crusader                                9  4.580000
132    Persuasion                                          9  3.221111
108    Extraction, Quickblade Of Trembling Hands           9  3.530000

In [238]:
# merge total values to others
item_hold2_df = pd.merge(item_hold_df, item_values_df, on=['ItemID', 'ItemName'],how='outer')
item_hold2_df

                                                     Price_x   Price_y  Price
ItemID ItemName
92     Final Critic                                       13  4.614615  59.99
178    Oathbreaker, Last Hope of the Breaking Storm       12  4.230000  50.76
145    Fiery Glass Crusader                                9  4.580000  41.22
132    Persuasion                                          9  3.221111  28.99
108    Extraction, Quickblade Of Trembling Hands           9  3.530000  31.77
...                                                      ...       ...    ...
42     The Decapitator                                     1  1.750000   1.75
51     Endbringer                                          1  4.660000   4.66
118    Ghost Reaver, Longsword of Magic                    1  2.170000   2.17
104    Gladiator's Glaive                                  1  1.930000   1.93
91     Celeste                                             1  4.170000   4.17

[179 rows x 3 columns]

In [240]:
# rename columns
item_analysis_df = item_hold2_df.rename(columns={'Price_x': 'Purchase Count', 'Price_y': 'Item Price', 'Price': 'Total Purchase Value'})
item_analysis_df

,,Purchase Count,Item Price,Total Purchase Value
ItemID,ItemName,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
...,...,...,...,...
42,The Decapitator,1,1.750000,1.75
51,Endbringer,1,4.660000,4.66
118,"Ghost Reaver, Longsword of Magic",1,2.170000,2.17
104,Gladiator's Glaive,1,1.930000,1.93
91,Celeste,1,4.170000,4.17

In [243]:
# Most Popular Items Table
top5_items_df = item_analysis_df.head(5)
top5_items_df

,,Purchase Count,Item Price,Total Purchase Value
ItemID,ItemName,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [247]:
# Resorting item_analysis_df by purchase value rather than item count
item_profit_df = item_analysis_df.sort_values(['Total Purchase Value'],ascending=False)
item_profit_df

,,Purchase Count,Item Price,Total Purchase Value
ItemID,ItemName,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80
...,...,...,...,...
28,"Flux, Destroyer of Due Diligence",2,1.060000,2.12
126,Exiled Mithril Longsword,1,2.000000,2.00
125,Whistling Mithril Warblade,2,1.000000,2.00
104,Gladiator's Glaive,1,1.930000,1.93
42,The Decapitator,1,1.750000,1.75

In [249]:
# Table for Most Profitable Items
top5_profit_df = item_profit_df.head(5)
top5_profit_df

,,Purchase Count,Item Price,Total Purchase Value
ItemID,ItemName,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80